# Concatenar y apendizar datos

In [1]:
import pandas as pd

In [2]:
red_wine = pd.read_csv("../datasets/wine/winequality-red.csv", sep=";")
red_wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [3]:
red_wine.columns.values

array(['fixed acidity', 'volatile acidity', 'citric acid',
       'residual sugar', 'chlorides', 'free sulfur dioxide',
       'total sulfur dioxide', 'density', 'pH', 'sulphates', 'alcohol',
       'quality'], dtype=object)

In [4]:
red_wine.shape

(1599, 12)

In [5]:
white_wine = pd.read_csv("../datasets/wine/winequality-white.csv", sep = ";")
white_wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.0,0.27,0.36,20.7,0.045,45.0,170.0,1.0010,3.00,0.45,8.8,6
1,6.3,0.30,0.34,1.6,0.049,14.0,132.0,0.9940,3.30,0.49,9.5,6
2,8.1,0.28,0.40,6.9,0.050,30.0,97.0,0.9951,3.26,0.44,10.1,6
3,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6
4,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6

In [6]:
white_wine.shape

(4898, 12)

En python tenemos dos tipos de ejes:
* axis = 0 denota el eje horizontal
* axis = 1 denota el eje vertical

In [7]:
wine_data = pd.concat([red_wine, white_wine], axis = 0)

In [8]:
wine_data.shape

(6497, 12)

In [9]:
wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [10]:
wine_scramble = pd.concat([wine_data.head(5), wine_data[300:310], wine_data.tail(5)], axis = 0)

In [11]:
wine_scramble

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5
1,7.8,0.880,0.00,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,5
2,7.8,0.760,0.04,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,5
3,11.2,0.280,0.56,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,6
4,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5
300,7.5,0.530,0.06,2.6,0.086,20.0,44.0,0.99650,3.38,0.59,10.7,6
301,11.1,0.180,0.48,1.5,0.068,7.0,15.0,0.99730,3.22,0.64,10.1,6
302,8.3,0.705,0.12,2.6,0.092,12.0,28.0,0.99940,3.51,0.72,10.0,5
303,7.4,0.670,0.12,1.6,0.186,5.0,21.0,0.99600,3.39,0.54,9.5,5
304,8.4,0.650,0.60,2.1,0.112,12.0,90.0,0.99730,3.20,0.52,9.2,5
305,10.3,0.530,0.48,2.5,0.063,6.0,25.0,0.99980,3.12,0.59,9.3,6
306,7.6,0.620,0.32,2.2,0.082,7.0,54.0,0.99660,3.36,0.52,9.4,5
307,10.3,0.410,0.42,2.4,0.213,6.0,14.0,0.99940,3.19,0.62,9.5,6
308,10.3,0.430,0.44,2.4,0.214,5.0,12.0,0.99940,3.19,0.63,9.5,6
309,7.4,0.290,0.38,1.7,0.062,9.0,30.0,0.99680,3.41,0.53,9.5,6
4893,6.2,0.210,0.29,1.6,0.039,24.0,92.0,0.99114,3.27,0.50,11.2,6
4894,6.6,0.320,0.36,8.0,0.047,57.0,168.0,0.99490,3.15,0.46,9.6,5
4895,6.5,0.240,0.19,1.2,0.041,30.0,111.0,0.99254,2.99,0.46,9.4,6
4896,5.5,0.290,0.30,1.1,0.022,20.0,110.0,0.98869,3.34,0.38,12.8,7
4897,6.0,0.210,0.38,0.8,0.020,22.0,98.0,0.98941,3.26,0.32,11.8,6

In [12]:
#data = pd.read_csv("../datasets/distributed-data/001.csv")
#data.head()

In [13]:
#data.shape[0] / 365

* Importar el primer fichero
* Hacemos un bucle para ir recorriendo todos los ficheros
    * Importante tener una consistencia en el nombre de los ficheros
    * Importamos los ficheros uno a uno
    * Cada uno de ellos debe apendizarse del primer fichero que ya hab√≠amos fichado
* repetimos el bucle

In [14]:
filepath = "../datasets/distributed-data/"
data = pd.read_csv("../datasets/distributed-data/001.csv")
final_length = len(data)

In [15]:
for i in range(2, 333):
    if i < 10:
        filename = "00" + str(i) 
    if 10 <= i < 100:
        filename = "0" + str(i)
    if i >= 100:
        filename = str(i)
        
    temp_data = pd.read_csv(filepath + filename + ".csv")
    final_length += len(temp_data)
    data = pd.concat([data, temp_data], axis = 0)

In [16]:
data.shape

(772087, 4)

In [17]:
data.tail()

           Date  sulfate  nitrate   ID
726  2004-12-27      NaN      NaN  332
727  2004-12-28      NaN      NaN  332
728  2004-12-29      NaN      NaN  332
729  2004-12-30      NaN      NaN  332
730  2004-12-31      NaN      NaN  332

In [18]:
final_length

772087

## Join de datasets

In [19]:
filepath = "../datasets/athletes/"
filename = "Medals.csv"
data_main = pd.read_csv(filepath + filename, encoding = "ISO-8859-1")

In [20]:
data_main.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6

In [21]:
a = data_main["Athlete"].unique().tolist()

In [22]:
len(a)

6956

In [23]:
data_country = pd.read_csv(filepath + "Athelete_Country_Map.csv", encoding = "ISO-8859-1")

In [24]:
data_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

In [25]:
len(data_country)

6970

In [26]:
data_sports = pd.read_csv(filepath + "Athelete_Sports_Map.csv", encoding = "ISO-8859-1")

In [27]:
data_sports.head()

            Athlete       Sport
0    Michael Phelps    Swimming
1  Natalie Coughlin    Swimming
2     Aleksey Nemov  Gymnastics
3     Alicia Coutts    Swimming
4    Missy Franklin    Swimming

In [28]:
len(data_sports)

6975

In [29]:
data_country_dp = data_country.drop_duplicates(subset = "Athlete")

In [30]:
len(data_country_dp)

6956

In [31]:
data_main_country = pd.merge(left = data_main, right = data_country_dp, 
                             left_on="Athlete", right_on= "Athlete")

In [32]:
data_main_country.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States

In [33]:
data_main_country.shape

(8618, 9)

In [34]:
data_main_country[data_main_country["Athlete"] == "Aleksandar Ciric"]

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
1491,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia
1492,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia
1493,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia

In [35]:
data_sports_dp = data_sports.drop_duplicates(subset = "Athlete")

In [36]:
len(data_sports_dp)

6956

In [37]:
data_final = pd.merge(left=data_main_country, right=data_sports_dp,
                     left_on="Athlete", right_on="Athlete")

In [38]:
len(data_final)

8618

In [39]:
data_final[data_final["Athlete"] == "Aleksandar Ciric"]

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country,Sport
1491,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia,Waterpolo
1492,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia,Waterpolo
1493,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia,Waterpolo

In [40]:
from IPython.display import Image
import numpy as np

## Join

In [41]:
out_athletes = np.random.choice(data_main["Athlete"], size = 6, replace = False)
out_athletes

array(['Roseline Filion', 'Antoine Valois-Fortier', 'Anders Jacobsen',
       'Andr√© Heller', 'Jason Gardener', 'Lisanne de Roever'],
      dtype=object)

In [42]:
data_country_dlt = data_country_dp[(~data_country_dp["Athlete"].isin(out_athletes)) &
                                   (data_country_dp["Athlete"] != "Michael Phelps")]

In [43]:
data_sports_dlt = data_sports_dp[(~data_sports_dp["Athlete"].isin(out_athletes)) & 
                                 (data_sports_dp["Athlete"] != "Michael Phelps")]

In [44]:
data_main_dlt = data_main[(~data_main["Athlete"].isin(out_athletes)) &
                         (data_main["Athlete"] != "Michael Phelps")]

In [45]:
data_country_dlt.head()

            Athlete        Country
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States
5       Ryan Lochte  United States

In [46]:
data_country_dlt.shape

(6949, 2)

In [51]:
len(data_country_dp) - len(data_country_dlt)

7

## Inner join

In [52]:
merged_inner = pd.merge(left = data_main, right = data_country_dlt,
                       how = "inner", left_on = "Athlete", right_on = "Athlete")

In [53]:
len(merged_inner)

8607

In [54]:
merged_inner.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
1,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States
2,Natalie Coughlin,29.0,2012,08/12/2012,0,0,1,1,United States
3,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6,Russia
4,Alicia Coutts,24.0,2012,08/12/2012,1,3,1,5,Australia

## Left Join

In [55]:
merged_left = pd.merge(left = data_main, right = data_country_dlt, 
                      how = "left", left_on = "Athlete", right_on = "Athlete")
len(merged_left)

8618

In [56]:
merged_left.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,NaN
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,NaN
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,NaN
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6,Russia

## Right Join

In [57]:
merged_right = pd.merge(left = data_main_dlt, right = data_country_dp,
                       how = "right", left_on = "Athlete", right_on = "Athlete")
len(merged_right)

8614

In [58]:
merged_right.tail(10)

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
8604,Wietse van Alten,21.0,2000.0,10/01/2000,0.0,0.0,1.0,1.0,Netherlands
8605,Sandra Wagner-Sachse,31.0,2000.0,10/01/2000,0.0,0.0,1.0,1.0,Germany
8606,Rod White,23.0,2000.0,10/01/2000,0.0,0.0,1.0,1.0,United States
8607,Michael Phelps,NaN,NaN,NaN,NaN,NaN,NaN,NaN,United States
8608,Andr√© Heller,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Brazil
8609,Anders Jacobsen,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Norway
8610,Antoine Valois-Fortier,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Canada
8611,Lisanne de Roever,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Netherlands
8612,Roseline Filion,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Canada
8613,Jason Gardener,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Great Britain

## Outer Join

In [48]:
data_country_jrf = data_country_dlt.append(
    {
        "Athlete" : "Juan Ram√≠rez Flores",
        "Country" :  "M√©xico"
    }, ignore_index = True
)

In [49]:
data_country_jrf.tail()

                   Athlete        Country
6945      Kateryna Serdiuk        Ukraine
6946      Wietse van Alten    Netherlands
6947  Sandra Wagner-Sachse        Germany
6948             Rod White  United States
6949   Juan Ram√≠rez Flores         M√©xico

In [60]:
merged_outer = pd.merge(left = data_main, right=data_country_jrf,
                       how = "outer", left_on = "Athlete", right_on="Athlete")
len(merged_outer)

8619

In [61]:
merged_outer.tail()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
8614,Kateryna Serdiuk,17.0,2000.0,10/01/2000,0.0,1.0,0.0,1.0,Ukraine
8615,Wietse van Alten,21.0,2000.0,10/01/2000,0.0,0.0,1.0,1.0,Netherlands
8616,Sandra Wagner-Sachse,31.0,2000.0,10/01/2000,0.0,0.0,1.0,1.0,Germany
8617,Rod White,23.0,2000.0,10/01/2000,0.0,0.0,1.0,1.0,United States
8618,Juan Ram√≠rez Flores,NaN,NaN,NaN,NaN,NaN,NaN,NaN,M√©xico

In [62]:
len(data_main)

8618

In [63]:
len(data_main_dlt)

8607

In [64]:
len(data_country_dp)

6956

In [65]:
len(data_country_dlt)

6949

In [66]:
len(merged_inner)

8607

In [67]:
len(merged_left)

8618

In [68]:
len(merged_right)

8614

In [69]:
len(merged_outer)

8619